Revit 2024 API
ConduitSizeSettingIterator.Reset Method
 Resets the iterator to the initial state.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public virtual void Reset()
Visual Basic
Public Overridable Sub Reset
Visual C++
public:
virtual void Reset()
See Also
ConduitSizeSettingIterator Class
Autodesk.Revit.DB.Electrical Namespace